[Czech]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Připojte adaptér 2,4 GHz USB zařízení k portu USB vašeho počítače pro spárování.
Please follow the steps below for pairing. = Proveďte spárování podle následujících kroků.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Nastavte přepínač připojení na režim RF 2,4 GHz.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Stiskněte a podržte levé, pravé a DPI tlačítko 3 sekundy.
3. Click the "Pair" button on the interface. = 3. Klikněte na tlačítko „Spárovat“ v rozhraní.	
1. Connect the device to your computer with the USB cable. = 1. Připojte zařízení k počítači kabelem USB.
2. Click the "Pair" button on the interface. = 2. Klikněte na tlačítko „Spárovat“ v rozhraní.

Pair = Spárovat
Close = Zavřít
Pairing = Párování
Pairing completed = Párování dokončeno
Pairing failed = Párování se nezdařilo

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Připojte zařízení k počítači pomocí kabelu USB a nastavte přepínač připojení do režimu RF 2,4 GHz.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Stiskněte a podržte funkční tlačítko po dobu 15 sekund, dokud neuslyšíte zvukové výzvy.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Odpojte a znovu vložte RF přijímač 2,4 GHz. Vypněte zařízení a přepněte zařízení do režimu RF 2,4 GHz.